// Заглушка для EditorJSFlexibleBlock
export const EditorJSFlexibleBlock = {
  class: class {
    static get toolbox() {
      return {
        title: 'Flexible Block',
        icon: '<svg width="17" height="15" viewBox="0 0 17 15" xmlns="http://www.w3.org/2000/svg"><path d="M13.568 4.205H12.01V2.645h1.559v1.56zm0 2.799h-1.559V5.445h1.559v1.559zm0 2.8h-1.559V8.244h1.559v1.56zm-7.263 0H4.746V8.244h1.559v1.56zm0-2.8H4.746V5.445h1.559v1.559zm0-2.799H4.746V2.645h1.559v1.56zm7.263-4.172H3.187C1.438-.017 0 1.42 0 3.17v8.102c0 1.75 1.438 3.187 3.187 3.187h10.381c1.75 0 3.188-1.436 3.188-3.187V3.17c0-1.75-1.438-3.187-3.188-3.187zm1.41 11.289c0 .778-.632 1.41-1.41 1.41H3.188c-.779 0-1.41-.632-1.41-1.41V3.17c0-.779.631-1.41 1.41-1.41h10.38c.779 0 1.41.631 1.41 1.41v8.102z"/></svg>'
      }
    }
  }
}; 